# Типы данных в питоне

# 1. NoneType - ничего, пустота -> None

# 2. Boolean -  истина или ложь -> True/False

# 3. String -  строки - str -> "hello world", 'Hello world'

# "My name is Bakberdi!"
# 'Im North King'

# 4. Числовые типы данных 
    # a) integer - целое число int -> -1, 2, 555
    # b) float -  число с плавающей точкой -> 1.5, 15.25
    # c) complex - 0j: 1, 5-9j

# 5. Списковые типы данных (коллекция)
    # a) list(массив/списоок) -> [5, 2, 4, True, 'Hello']
    # b) tuple (кортеж) -> (1, 2, 3, None)
    # c) rage (последовательность) -> range (1, 10)

# 6. set() - множество -> {1,2,3,4,5,6,7,8}

# 7. dict(словари) ->  содержат данные в себе в виде ключа и значение {1: 'one', 2: 'two'}

# -------------------------------------------------------------------------

#  mutable (изменяемые типы данных)
    # 1. list
    # 2. set
    # 3. dict

# Immutable(неизменяемые типы данных)
    # 1. none
    # 2. bool
    # 3. int, float, complaex
    # 4. str
    # 5. tuble, range
    # 6. frozenset

# --------------------------------------------------------------------------------------------------------------------

#  переменная - проименованная область памяти, предназначенная для хранения данных. С ее помощью мы может проводить различные операции с данным

# num = 5 
# str1 = 'Hello world!'
# '''
# Стандартный вывод данных
# '''
# #  В питоне для ввывода данных в терминал используется встроенная функция  print()
# # stroka = 'Hello world! My name is Bakberdi!'
# # print(stroka)
# # print(27+5)

# # '''
# стандартный ввод данных через 
# терминал используется функция inpet
# '''

# a = input('Введите число: ')
# num = int(a)
# # print(num)
# # print(type(num))
# # print('данныен в переменных:', a, num)
# print('В переменной а хранится:', a, 'ее тип данных', type(a))
# print('В переменно  num  хранится', num, 'ее тип данных', type(num))







