# GIT - распределенная система контроля версий - 
# Это система для отслеживания и ведения истории изменения файлов, в вашем проекте. 
# При помощи распределенности git еще и организововывается командная работа.

# Репазиторий - это хранилище вашего кода и истории его изменений

# DITHUB - Веп сайт для размещения git - репозиториев в совместной разработке проеков

#команда git:

# 1. git init - она создает новый локаьный репозиторий в той дирикторий которой была прописано команды.
# (Команда вволится один раз в начале)

# 2. git add - команда для добавления изменений в систему отслеживания гита 

# 3. git commit -m '<comment>' - Это команда для сохранения всех изммений в локальной репозиторий с комментарием к ним

# 4. git remote add <origin> <url> - Это команда для того что бы всязать ваш локальныйй репо с удаленным репо в гитхабе

# 5. git push <origin><main> - Это команда отправки всех ваших изменений на удаленный репо

# 6.

# 7. 






